In [1]:
import numpy as np
import pandas as pd

In [2]:
pd.DataFrame(
    {
        'id':[1,2],
        'store_nbr': [1,2],
        'family': ['POULTRY','PRODUCE']
    }
)

   id  store_nbr   family
0   1          1  POULTRY
1   2          2  PRODUCE

In [3]:
oil = pd.read_csv(
    'retail/oil.csv',
    parse_dates=['date']
)

In [4]:
path_retail = "retail/retail_2016_2017.csv"
retail = pd.read_csv(path_retail)

In [5]:
oil.dtypes

date          datetime64[ns]
dcoilwtico           float64
dtype: object

In [6]:
oil.shape

(1218, 2)

In [7]:
oil.index

RangeIndex(start=0, stop=1218, step=1)

In [8]:
oil.columns

Index(['date', 'dcoilwtico'], dtype='object')

In [9]:
oil.columns = ['price date','oil price']

In [10]:
oil

     price date  oil price
0    2013-01-01        NaN
1    2013-01-02      93.14
2    2013-01-03      92.97
3    2013-01-04      93.12
4    2013-01-07      93.20
...         ...        ...
1213 2017-08-25      47.65
1214 2017-08-28      46.40
1215 2017-08-29      46.46
1216 2017-08-30      45.96
1217 2017-08-31      47.26

[1218 rows x 2 columns]

In [11]:
oil.axes

[RangeIndex(start=0, stop=1218, step=1),
 Index(['price date', 'oil price'], dtype='object')]

In [12]:
oil.dtypes

price date    datetime64[ns]
oil price            float64
dtype: object

In [13]:
oil.head()

  price date  oil price
0 2013-01-01        NaN
1 2013-01-02      93.14
2 2013-01-03      92.97
3 2013-01-04      93.12
4 2013-01-07      93.20

In [14]:
oil.head(6)

  price date  oil price
0 2013-01-01        NaN
1 2013-01-02      93.14
2 2013-01-03      92.97
3 2013-01-04      93.12
4 2013-01-07      93.20
5 2013-01-08      93.21

In [15]:
oil.sample(5)

     price date  oil price
213  2013-10-25      97.40
1133 2017-05-05      46.23
1011 2016-11-16      45.56
144  2013-07-22     106.61
930  2016-07-26      42.16

In [16]:
oil.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1218 entries, 0 to 1217
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   price date  1218 non-null   datetime64[ns]
 1   oil price   1175 non-null   float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 19.2 KB

In [17]:
oil.describe()

         oil price
count  1175.000000
mean     67.714366
std      25.630476
min      26.190000
25%      46.405000
50%      53.190000
75%      95.660000
max     110.620000

In [18]:
oil.describe().loc['std','oil price']

25.630475729453224

In [19]:
oil.sample(5, random_state=12345)

     price date  oil price
656  2015-07-08      51.61
502  2014-12-04      66.73
111  2013-06-05      93.66
1134 2017-05-08      46.46
931  2016-07-27      41.90

In [20]:
oil.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1218 entries, 0 to 1217
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   price date  1218 non-null   datetime64[ns]
 1   oil price   1175 non-null   float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 19.2 KB

In [21]:
oil.describe(include='all').round()

C:\Users\macie\AppData\Local\Temp\ipykernel_5500\3275947296.py:1: FutureWarning: Treating datetime data as categorical rather than numeric in `.describe` is deprecated and will be removed in a future version of pandas. Specify `datetime_is_numeric=True` to silence this warning and adopt the future behavior now.
  oil.describe(include='all').round()

                 price date  oil price
count                  1218     1175.0
unique                 1218        NaN
top     2013-01-01 00:00:00        NaN
freq                      1        NaN
first   2013-01-01 00:00:00        NaN
last    2017-08-31 00:00:00        NaN
mean                    NaN       68.0
std                     NaN       26.0
min                     NaN       26.0
25%                     NaN       46.0
50%                     NaN       53.0
75%                     NaN       96.0
max                     NaN      111.0

In [22]:
oil

     price date  oil price
0    2013-01-01        NaN
1    2013-01-02      93.14
2    2013-01-03      92.97
3    2013-01-04      93.12
4    2013-01-07      93.20
...         ...        ...
1213 2017-08-25      47.65
1214 2017-08-28      46.40
1215 2017-08-29      46.46
1216 2017-08-30      45.96
1217 2017-08-31      47.26

[1218 rows x 2 columns]

In [23]:
oil.columns = ['price_date','oil_price']

In [24]:
oil.price_date

0      2013-01-01
1      2013-01-02
2      2013-01-03
3      2013-01-04
4      2013-01-07
          ...
1213   2017-08-25
1214   2017-08-28
1215   2017-08-29
1216   2017-08-30
1217   2017-08-31
Name: price_date, Length: 1218, dtype: datetime64[ns]

In [25]:
oil['price_date'].iloc[:5]

0   2013-01-01
1   2013-01-02
2   2013-01-03
3   2013-01-04
4   2013-01-07
Name: price_date, dtype: datetime64[ns]

In [26]:
retail

,id,date,store_nbr,family,sales,onpromotion
0,1945944,2016-01-01,1,AUTOMOTIVE,0.000,0
1,1945945,2016-01-01,1,BABY CARE,0.000,0
2,1945946,2016-01-01,1,BEAUTY,0.000,0
3,1945947,2016-01-01,1,BEVERAGES,0.000,0
4,1945948,2016-01-01,1,BOOKS,0.000,0
...,...,...,...,...,...,...
1054939,3000883,2017-08-15,9,POULTRY,438.133,0
1054940,3000884,2017-08-15,9,PREPARED FOODS,154.553,1
1054941,3000885,2017-08-15,9,PRODUCE,2419.729,148
1054942,3000886,2017-08-15,9,SCHOOL AND OFFICE SUPPLIES,121.000,8
1054943,3000887,2017-08-15,9,SEAFOOD,16.000,0

In [27]:
retail[['family','store_nbr']] # return dataframe

                             family  store_nbr
0                        AUTOMOTIVE          1
1                         BABY CARE          1
2                            BEAUTY          1
3                         BEVERAGES          1
4                             BOOKS          1
...                             ...        ...
1054939                     POULTRY          9
1054940              PREPARED FOODS          9
1054941                     PRODUCE          9
1054942  SCHOOL AND OFFICE SUPPLIES          9
1054943                     SEAFOOD          9

[1054944 rows x 2 columns]

In [28]:
retail[['family']] # return dataframe by passing a list as argument

                             family
0                        AUTOMOTIVE
1                         BABY CARE
2                            BEAUTY
3                         BEVERAGES
4                             BOOKS
...                             ...
1054939                     POULTRY
1054940              PREPARED FOODS
1054941                     PRODUCE
1054942  SCHOOL AND OFFICE SUPPLIES
1054943                     SEAFOOD

[1054944 rows x 1 columns]

In [29]:
retail['family'] # return series

0                          AUTOMOTIVE
1                           BABY CARE
2                              BEAUTY
3                           BEVERAGES
4                               BOOKS
                      ...
1054939                       POULTRY
1054940                PREPARED FOODS
1054941                       PRODUCE
1054942    SCHOOL AND OFFICE SUPPLIES
1054943                       SEAFOOD
Name: family, Length: 1054944, dtype: object

In [30]:
retail.iloc[:5,1:4] #first 5 rows, 2-4 columns

         date  store_nbr      family
0  2016-01-01          1  AUTOMOTIVE
1  2016-01-01          1   BABY CARE
2  2016-01-01          1      BEAUTY
3  2016-01-01          1   BEVERAGES
4  2016-01-01          1       BOOKS

In [31]:
retail.loc[:,'date']

0          2016-01-01
1          2016-01-01
2          2016-01-01
3          2016-01-01
4          2016-01-01
              ...
1054939    2017-08-15
1054940    2017-08-15
1054941    2017-08-15
1054942    2017-08-15
1054943    2017-08-15
Name: date, Length: 1054944, dtype: object

In [32]:
retail.loc[:,['date']]

               date
0        2016-01-01
1        2016-01-01
2        2016-01-01
3        2016-01-01
4        2016-01-01
...             ...
1054939  2017-08-15
1054940  2017-08-15
1054941  2017-08-15
1054942  2017-08-15
1054943  2017-08-15

[1054944 rows x 1 columns]

In [33]:
retail.loc[:,'date':'sales']

               date  store_nbr                      family     sales
0        2016-01-01          1                  AUTOMOTIVE     0.000
1        2016-01-01          1                   BABY CARE     0.000
2        2016-01-01          1                      BEAUTY     0.000
3        2016-01-01          1                   BEVERAGES     0.000
4        2016-01-01          1                       BOOKS     0.000
...             ...        ...                         ...       ...
1054939  2017-08-15          9                     POULTRY   438.133
1054940  2017-08-15          9              PREPARED FOODS   154.553
1054941  2017-08-15          9                     PRODUCE  2419.729
1054942  2017-08-15          9  SCHOOL AND OFFICE SUPPLIES   121.000
1054943  2017-08-15          9                     SEAFOOD    16.000

[1054944 rows x 4 columns]

In [34]:
oil.head()

  price_date  oil_price
0 2013-01-01        NaN
1 2013-01-02      93.14
2 2013-01-03      92.97
3 2013-01-04      93.12
4 2013-01-07      93.20

In [35]:
oil.iloc[:10,0:1]

  price_date
0 2013-01-01
1 2013-01-02
2 2013-01-03
3 2013-01-04
4 2013-01-07
5 2013-01-08
6 2013-01-09
7 2013-01-10
8 2013-01-11
9 2013-01-14

In [36]:
oil.iloc[:10,[-1]]

   oil_price
0        NaN
1      93.14
2      92.97
3      93.12
4      93.20
5      93.21
6      93.08
7      93.81
8      93.60
9      94.27

In [37]:
oil.iloc[:10,-2:-1]

  price_date
0 2013-01-01
1 2013-01-02
2 2013-01-03
3 2013-01-04
4 2013-01-07
5 2013-01-08
6 2013-01-09
7 2013-01-10
8 2013-01-11
9 2013-01-14

In [38]:
oil.loc[0:5,:] # loc last row inclusive

  price_date  oil_price
0 2013-01-01        NaN
1 2013-01-02      93.14
2 2013-01-03      92.97
3 2013-01-04      93.12
4 2013-01-07      93.20
5 2013-01-08      93.21

In [39]:
oil.iloc[0:5,:] # iloc last row exclusive

  price_date  oil_price
0 2013-01-01        NaN
1 2013-01-02      93.14
2 2013-01-03      92.97
3 2013-01-04      93.12
4 2013-01-07      93.20

In [40]:
retail

,id,date,store_nbr,family,sales,onpromotion
0,1945944,2016-01-01,1,AUTOMOTIVE,0.000,0
1,1945945,2016-01-01,1,BABY CARE,0.000,0
2,1945946,2016-01-01,1,BEAUTY,0.000,0
3,1945947,2016-01-01,1,BEVERAGES,0.000,0
4,1945948,2016-01-01,1,BOOKS,0.000,0
...,...,...,...,...,...,...
1054939,3000883,2017-08-15,9,POULTRY,438.133,0
1054940,3000884,2017-08-15,9,PREPARED FOODS,154.553,1
1054941,3000885,2017-08-15,9,PRODUCE,2419.729,148
1054942,3000886,2017-08-15,9,SCHOOL AND OFFICE SUPPLIES,121.000,8
1054943,3000887,2017-08-15,9,SEAFOOD,16.000,0

In [41]:
retail.drop('id',axis=1)

,date,store_nbr,family,sales,onpromotion
0,2016-01-01,1,AUTOMOTIVE,0.000,0
1,2016-01-01,1,BABY CARE,0.000,0
2,2016-01-01,1,BEAUTY,0.000,0
3,2016-01-01,1,BEVERAGES,0.000,0
4,2016-01-01,1,BOOKS,0.000,0
...,...,...,...,...,...
1054939,2017-08-15,9,POULTRY,438.133,0
1054940,2017-08-15,9,PREPARED FOODS,154.553,1
1054941,2017-08-15,9,PRODUCE,2419.729,148
1054942,2017-08-15,9,SCHOOL AND OFFICE SUPPLIES,121.000,8
1054943,2017-08-15,9,SEAFOOD,16.000,0

In [42]:
retail.drop(['id','onpromotion'],inplace=True,axis=1)

In [43]:
retail

               date  store_nbr                      family     sales
0        2016-01-01          1                  AUTOMOTIVE     0.000
1        2016-01-01          1                   BABY CARE     0.000
2        2016-01-01          1                      BEAUTY     0.000
3        2016-01-01          1                   BEVERAGES     0.000
4        2016-01-01          1                       BOOKS     0.000
...             ...        ...                         ...       ...
1054939  2017-08-15          9                     POULTRY   438.133
1054940  2017-08-15          9              PREPARED FOODS   154.553
1054941  2017-08-15          9                     PRODUCE  2419.729
1054942  2017-08-15          9  SCHOOL AND OFFICE SUPPLIES   121.000
1054943  2017-08-15          9                     SEAFOOD    16.000

[1054944 rows x 4 columns]

In [44]:
retail.drop(0,axis=0)

               date  store_nbr                      family     sales
1        2016-01-01          1                   BABY CARE     0.000
2        2016-01-01          1                      BEAUTY     0.000
3        2016-01-01          1                   BEVERAGES     0.000
4        2016-01-01          1                       BOOKS     0.000
5        2016-01-01          1                BREAD/BAKERY     0.000
...             ...        ...                         ...       ...
1054939  2017-08-15          9                     POULTRY   438.133
1054940  2017-08-15          9              PREPARED FOODS   154.553
1054941  2017-08-15          9                     PRODUCE  2419.729
1054942  2017-08-15          9  SCHOOL AND OFFICE SUPPLIES   121.000
1054943  2017-08-15          9                     SEAFOOD    16.000

[1054943 rows x 4 columns]

In [45]:
retail.drop(range(5),axis=0)

               date  store_nbr                      family     sales
5        2016-01-01          1                BREAD/BAKERY     0.000
6        2016-01-01          1                 CELEBRATION     0.000
7        2016-01-01          1                    CLEANING     0.000
8        2016-01-01          1                       DAIRY     0.000
9        2016-01-01          1                        DELI     0.000
...             ...        ...                         ...       ...
1054939  2017-08-15          9                     POULTRY   438.133
1054940  2017-08-15          9              PREPARED FOODS   154.553
1054941  2017-08-15          9                     PRODUCE  2419.729
1054942  2017-08-15          9  SCHOOL AND OFFICE SUPPLIES   121.000
1054943  2017-08-15          9                     SEAFOOD    16.000

[1054939 rows x 4 columns]

In [46]:
retail.shape

(1054944, 4)

In [47]:
retail.nunique()

date            592
store_nbr        54
family           33
sales        181592
dtype: int64

In [48]:
retail.duplicated()

0          False
1          False
2          False
3          False
4          False
           ...
1054939    False
1054940    False
1054941    False
1054942    False
1054943    False
Length: 1054944, dtype: bool

In [49]:
retail.duplicated().loc[retail.duplicated() == False]

0          False
1          False
2          False
3          False
4          False
           ...
1054939    False
1054940    False
1054941    False
1054942    False
1054943    False
Length: 1054944, dtype: bool

In [50]:
retail

               date  store_nbr                      family     sales
0        2016-01-01          1                  AUTOMOTIVE     0.000
1        2016-01-01          1                   BABY CARE     0.000
2        2016-01-01          1                      BEAUTY     0.000
3        2016-01-01          1                   BEVERAGES     0.000
4        2016-01-01          1                       BOOKS     0.000
...             ...        ...                         ...       ...
1054939  2017-08-15          9                     POULTRY   438.133
1054940  2017-08-15          9              PREPARED FOODS   154.553
1054941  2017-08-15          9                     PRODUCE  2419.729
1054942  2017-08-15          9  SCHOOL AND OFFICE SUPPLIES   121.000
1054943  2017-08-15          9                     SEAFOOD    16.000

[1054944 rows x 4 columns]

In [51]:
retail.duplicated(subset='family')

0          False
1          False
2          False
3          False
4          False
           ...
1054939     True
1054940     True
1054941     True
1054942     True
1054943     True
Length: 1054944, dtype: bool

In [52]:
retail.drop_duplicates()

               date  store_nbr                      family     sales
0        2016-01-01          1                  AUTOMOTIVE     0.000
1        2016-01-01          1                   BABY CARE     0.000
2        2016-01-01          1                      BEAUTY     0.000
3        2016-01-01          1                   BEVERAGES     0.000
4        2016-01-01          1                       BOOKS     0.000
...             ...        ...                         ...       ...
1054939  2017-08-15          9                     POULTRY   438.133
1054940  2017-08-15          9              PREPARED FOODS   154.553
1054941  2017-08-15          9                     PRODUCE  2419.729
1054942  2017-08-15          9  SCHOOL AND OFFICE SUPPLIES   121.000
1054943  2017-08-15          9                     SEAFOOD    16.000

[1054944 rows x 4 columns]

In [53]:
retail.drop_duplicates(subset='family', keep='last',ignore_index=True)

          date  store_nbr                      family     sales
0   2017-08-15          9                  AUTOMOTIVE    15.000
1   2017-08-15          9                   BABY CARE     0.000
2   2017-08-15          9                      BEAUTY    10.000
3   2017-08-15          9                   BEVERAGES  3530.000
4   2017-08-15          9                       BOOKS     0.000
5   2017-08-15          9                BREAD/BAKERY   528.000
6   2017-08-15          9                 CELEBRATION    16.000
7   2017-08-15          9                    CLEANING  1439.000
8   2017-08-15          9                       DAIRY   835.000
9   2017-08-15          9                        DELI   551.713
10  2017-08-15          9                        EGGS   244.000
11  2017-08-15          9                FROZEN FOODS   133.738
12  2017-08-15          9                   GROCERY I  6630.383
13  2017-08-15          9                  GROCERY II     9.000
14  2017-08-15          9                    HARDWARE     1.000
15  2017-08-15          9          HOME AND KITCHEN I    64.000
16  2017-08-15          9         HOME AND KITCHEN II    61.000
17  2017-08-15          9             HOME APPLIANCES     0.000
18  2017-08-15          9                   HOME CARE   373.000
19  2017-08-15          9                  LADIESWEAR    10.000
20  2017-08-15          9             LAWN AND GARDEN    11.000
21  2017-08-15          9                    LINGERIE     6.000
22  2017-08-15          9            LIQUOR,WINE,BEER    25.000
23  2017-08-15          9                   MAGAZINES    11.000
24  2017-08-15          9                       MEATS   449.228
25  2017-08-15          9               PERSONAL CARE   522.000
26  2017-08-15          9                PET SUPPLIES     6.000
27  2017-08-15          9     PLAYERS AND ELECTRONICS     6.000
28  2017-08-15          9                     POULTRY   438.133
29  2017-08-15          9              PREPARED FOODS   154.553
30  2017-08-15          9                     PRODUCE  2419.729
31  2017-08-15          9  SCHOOL AND OFFICE SUPPLIES   121.000
32  2017-08-15          9                     SEAFOOD    16.000

In [54]:
oil = oil.append(oil.iloc[-1]).reset_index(drop=True)

C:\Users\macie\AppData\Local\Temp\ipykernel_5500\2701637165.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  oil = oil.append(oil.iloc[-1]).reset_index(drop=True)

In [55]:
oil

     price_date  oil_price
0    2013-01-01        NaN
1    2013-01-02      93.14
2    2013-01-03      92.97
3    2013-01-04      93.12
4    2013-01-07      93.20
...         ...        ...
1214 2017-08-28      46.40
1215 2017-08-29      46.46
1216 2017-08-30      45.96
1217 2017-08-31      47.26
1218 2017-08-31      47.26

[1219 rows x 2 columns]

In [56]:
oil.shape

(1219, 2)

In [57]:
oil.nunique(dropna=False)

price_date    1218
oil_price      999
dtype: int64

In [58]:
oil.duplicated(subset='oil_price').sum()

220

In [59]:
oil.drop_duplicates()

     price_date  oil_price
0    2013-01-01        NaN
1    2013-01-02      93.14
2    2013-01-03      92.97
3    2013-01-04      93.12
4    2013-01-07      93.20
...         ...        ...
1213 2017-08-25      47.65
1214 2017-08-28      46.40
1215 2017-08-29      46.46
1216 2017-08-30      45.96
1217 2017-08-31      47.26

[1218 rows x 2 columns]

In [60]:
oil.drop_duplicates(keep='last')

     price_date  oil_price
0    2013-01-01        NaN
1    2013-01-02      93.14
2    2013-01-03      92.97
3    2013-01-04      93.12
4    2013-01-07      93.20
...         ...        ...
1213 2017-08-25      47.65
1214 2017-08-28      46.40
1215 2017-08-29      46.46
1216 2017-08-30      45.96
1218 2017-08-31      47.26

[1218 rows x 2 columns]

In [61]:
oil.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1219 entries, 0 to 1218
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   price_date  1219 non-null   datetime64[ns]
 1   oil_price   1176 non-null   float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 19.2 KB

In [62]:
oil.fillna(0).info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1219 entries, 0 to 1218
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   price_date  1219 non-null   datetime64[ns]
 1   oil_price   1219 non-null   float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 19.2 KB

In [63]:
oil.fillna({'oil_price': 0}) # fill specific column

     price_date  oil_price
0    2013-01-01       0.00
1    2013-01-02      93.14
2    2013-01-03      92.97
3    2013-01-04      93.12
4    2013-01-07      93.20
...         ...        ...
1214 2017-08-28      46.40
1215 2017-08-29      46.46
1216 2017-08-30      45.96
1217 2017-08-31      47.26
1218 2017-08-31      47.26

[1219 rows x 2 columns]

In [64]:
oil.dropna().info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1176 entries, 1 to 1218
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   price_date  1176 non-null   datetime64[ns]
 1   oil_price   1176 non-null   float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 27.6 KB

In [65]:
oil.dropna(subset='oil_price').info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1176 entries, 1 to 1218
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   price_date  1176 non-null   datetime64[ns]
 1   oil_price   1176 non-null   float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 27.6 KB

In [66]:
retail

               date  store_nbr                      family     sales
0        2016-01-01          1                  AUTOMOTIVE     0.000
1        2016-01-01          1                   BABY CARE     0.000
2        2016-01-01          1                      BEAUTY     0.000
3        2016-01-01          1                   BEVERAGES     0.000
4        2016-01-01          1                       BOOKS     0.000
...             ...        ...                         ...       ...
1054939  2017-08-15          9                     POULTRY   438.133
1054940  2017-08-15          9              PREPARED FOODS   154.553
1054941  2017-08-15          9                     PRODUCE  2419.729
1054942  2017-08-15          9  SCHOOL AND OFFICE SUPPLIES   121.000
1054943  2017-08-15          9                     SEAFOOD    16.000

[1054944 rows x 4 columns]

In [67]:
retail.loc[retail['date'] == '2017-08-15']

               date  store_nbr                      family     sales
1053162  2017-08-15          1                  AUTOMOTIVE     4.000
1053163  2017-08-15          1                   BABY CARE     0.000
1053164  2017-08-15          1                      BEAUTY     4.000
1053165  2017-08-15          1                   BEVERAGES  1942.000
1053166  2017-08-15          1                       BOOKS     0.000
...             ...        ...                         ...       ...
1054939  2017-08-15          9                     POULTRY   438.133
1054940  2017-08-15          9              PREPARED FOODS   154.553
1054941  2017-08-15          9                     PRODUCE  2419.729
1054942  2017-08-15          9  SCHOOL AND OFFICE SUPPLIES   121.000
1054943  2017-08-15          9                     SEAFOOD    16.000

[1782 rows x 4 columns]

In [68]:
retail.loc[retail['date'] == '2017-08-15',['date','sales']]

               date     sales
1053162  2017-08-15     4.000
1053163  2017-08-15     0.000
1053164  2017-08-15     4.000
1053165  2017-08-15  1942.000
1053166  2017-08-15     0.000
...             ...       ...
1054939  2017-08-15   438.133
1054940  2017-08-15   154.553
1054941  2017-08-15  2419.729
1054942  2017-08-15   121.000
1054943  2017-08-15    16.000

[1782 rows x 2 columns]

In [69]:
conditions = retail['family'].isin(['CLEANING','DAIRY']) & retail['sales'] > 0

retail[conditions]

               date  store_nbr    family   sales
568      2016-01-01         25  CLEANING   734.0
569      2016-01-01         25     DAIRY  1033.0
1789     2016-01-02          1  CLEANING   526.0
1790     2016-01-02          1     DAIRY   627.0
1822     2016-01-02         10  CLEANING  1216.0
...             ...        ...       ...     ...
1054853  2017-08-15          7     DAIRY  1279.0
1054885  2017-08-15          8  CLEANING  1198.0
1054886  2017-08-15          8     DAIRY  1330.0
1054918  2017-08-15          9  CLEANING  1439.0
1054919  2017-08-15          9     DAIRY   835.0

[62415 rows x 4 columns]

In [70]:
oil['benchmark'] = 100

In [71]:
oil[oil['oil_price'] > 100]

    price_date  oil_price  benchmark
131 2013-07-03     101.92        100
133 2013-07-05     103.09        100
134 2013-07-08     103.03        100
135 2013-07-09     103.46        100
136 2013-07-10     106.41        100
..         ...        ...        ...
407 2014-07-24     102.76        100
408 2014-07-25     105.23        100
409 2014-07-28     105.68        100
410 2014-07-29     104.91        100
411 2014-07-30     104.29        100

[182 rows x 3 columns]

In [72]:
oil.loc[oil['oil_price'] > 100]

    price_date  oil_price  benchmark
131 2013-07-03     101.92        100
133 2013-07-05     103.09        100
134 2013-07-08     103.03        100
135 2013-07-09     103.46        100
136 2013-07-10     106.41        100
..         ...        ...        ...
407 2014-07-24     102.76        100
408 2014-07-25     105.23        100
409 2014-07-28     105.68        100
410 2014-07-29     104.91        100
411 2014-07-30     104.29        100

[182 rows x 3 columns]

In [73]:
oil.loc[oil['oil_price'] > oil['benchmark']]

    price_date  oil_price  benchmark
131 2013-07-03     101.92        100
133 2013-07-05     103.09        100
134 2013-07-08     103.03        100
135 2013-07-09     103.46        100
136 2013-07-10     106.41        100
..         ...        ...        ...
407 2014-07-24     102.76        100
408 2014-07-25     105.23        100
409 2014-07-28     105.68        100
410 2014-07-29     104.91        100
411 2014-07-30     104.29        100

[182 rows x 3 columns]

In [74]:
retail.query('family in ["CLEANING","DAIRY"] and sales > 0')

               date  store_nbr    family   sales
568      2016-01-01         25  CLEANING   734.0
569      2016-01-01         25     DAIRY  1033.0
1789     2016-01-02          1  CLEANING   526.0
1790     2016-01-02          1     DAIRY   627.0
1822     2016-01-02         10  CLEANING  1216.0
...             ...        ...       ...     ...
1054853  2017-08-15          7     DAIRY  1279.0
1054885  2017-08-15          8  CLEANING  1198.0
1054886  2017-08-15          8     DAIRY  1330.0
1054918  2017-08-15          9  CLEANING  1439.0
1054919  2017-08-15          9     DAIRY   835.0

[62415 rows x 4 columns]

In [75]:
avg_sales = retail.loc[:,'sales'].mean()
avg_sales

457.72248700136413

In [76]:
retail.query('sales > @avg_sales')

               date  store_nbr         family     sales
564      2016-01-01         25      BEVERAGES  5104.000
566      2016-01-01         25   BREAD/BAKERY   680.952
568      2016-01-01         25       CLEANING   734.000
569      2016-01-01         25          DAIRY  1033.000
572      2016-01-01         25   FROZEN FOODS   596.125
...             ...        ...            ...       ...
1054919  2017-08-15          9          DAIRY   835.000
1054920  2017-08-15          9           DELI   551.713
1054923  2017-08-15          9      GROCERY I  6630.383
1054936  2017-08-15          9  PERSONAL CARE   522.000
1054941  2017-08-15          9        PRODUCE  2419.729

[194232 rows x 4 columns]

In [77]:
oil

     price_date  oil_price  benchmark
0    2013-01-01        NaN        100
1    2013-01-02      93.14        100
2    2013-01-03      92.97        100
3    2013-01-04      93.12        100
4    2013-01-07      93.20        100
...         ...        ...        ...
1214 2017-08-28      46.40        100
1215 2017-08-29      46.46        100
1216 2017-08-30      45.96        100
1217 2017-08-31      47.26        100
1218 2017-08-31      47.26        100

[1219 rows x 3 columns]

In [78]:
oil.query("oil_price > benchmark or price_date.dt.year == 2015")

    price_date  oil_price  benchmark
131 2013-07-03     101.92        100
133 2013-07-05     103.09        100
134 2013-07-08     103.03        100
135 2013-07-09     103.46        100
136 2013-07-10     106.41        100
..         ...        ...        ...
778 2015-12-25        NaN        100
779 2015-12-28      36.36        100
780 2015-12-29      37.88        100
781 2015-12-30      36.59        100
782 2015-12-31      37.13        100

[443 rows x 3 columns]

In [79]:
condition = retail.family.isin(['BEVERAGES','DELI','DAIRY'])
sample_retail = retail[condition].sample(5,random_state=2021)

In [80]:
sample_retail.sort_index(ascending=False)

              date  store_nbr     family     sales
882588  2017-05-11         23  BEVERAGES  1194.000
495966  2016-10-05         25       DELI     0.000
445008  2016-09-06         45  BEVERAGES  8339.000
74292   2016-02-11         43       DELI   212.000
13506   2016-01-08         38       DELI   131.545

In [81]:
sample_retail.sort_index(axis=1,ascending=False)

        store_nbr     sales     family        date
74292          43   212.000       DELI  2016-02-11
13506          38   131.545       DELI  2016-01-08
882588         23  1194.000  BEVERAGES  2017-05-11
445008         45  8339.000  BEVERAGES  2016-09-06
495966         25     0.000       DELI  2016-10-05

In [82]:
sample_retail.sort_values('date',ascending=False)

              date  store_nbr     family     sales
882588  2017-05-11         23  BEVERAGES  1194.000
495966  2016-10-05         25       DELI     0.000
445008  2016-09-06         45  BEVERAGES  8339.000
74292   2016-02-11         43       DELI   212.000
13506   2016-01-08         38       DELI   131.545

In [83]:
sample_retail.sort_values(['date','store_nbr'],ascending=[True,False])

              date  store_nbr     family     sales
13506   2016-01-08         38       DELI   131.545
74292   2016-02-11         43       DELI   212.000
445008  2016-09-06         45  BEVERAGES  8339.000
495966  2016-10-05         25       DELI     0.000
882588  2017-05-11         23  BEVERAGES  1194.000

In [84]:
sample_retail

              date  store_nbr     family     sales
74292   2016-02-11         43       DELI   212.000
13506   2016-01-08         38       DELI   131.545
882588  2017-05-11         23  BEVERAGES  1194.000
445008  2016-09-06         45  BEVERAGES  8339.000
495966  2016-10-05         25       DELI     0.000

In [85]:
sample_retail.columns = ['Date','Store Number', 'Family','Sales']

In [86]:
sample_retail.columns = [col.upper() for col in sample_retail.columns]

In [87]:
sample_retail.rename(columns={'DATE':'Date'})

              Date  STORE NUMBER     FAMILY     SALES
74292   2016-02-11            43       DELI   212.000
13506   2016-01-08            38       DELI   131.545
882588  2017-05-11            23  BEVERAGES  1194.000
445008  2016-09-06            45  BEVERAGES  8339.000
495966  2016-10-05            25       DELI     0.000

In [88]:
sample_retail.rename(columns= lambda x: x.lower())

              date  store number     family     sales
74292   2016-02-11            43       DELI   212.000
13506   2016-01-08            38       DELI   131.545
882588  2017-05-11            23  BEVERAGES  1194.000
445008  2016-09-06            45  BEVERAGES  8339.000
495966  2016-10-05            25       DELI     0.000

In [89]:
retail.reindex(labels=['date','family','store_nbr','sales'],axis=1)

               date                      family  store_nbr     sales
0        2016-01-01                  AUTOMOTIVE          1     0.000
1        2016-01-01                   BABY CARE          1     0.000
2        2016-01-01                      BEAUTY          1     0.000
3        2016-01-01                   BEVERAGES          1     0.000
4        2016-01-01                       BOOKS          1     0.000
...             ...                         ...        ...       ...
1054939  2017-08-15                     POULTRY          9   438.133
1054940  2017-08-15              PREPARED FOODS          9   154.553
1054941  2017-08-15                     PRODUCE          9  2419.729
1054942  2017-08-15  SCHOOL AND OFFICE SUPPLIES          9   121.000
1054943  2017-08-15                     SEAFOOD          9    16.000

[1054944 rows x 4 columns]

In [90]:
retail['tax_amount'] = retail['sales'] * 0.05

In [91]:
retail['total'] = retail['sales'] + retail['tax_amount']

In [92]:
retail['taxable_category'] = retail['family'] == 'BABY CARE'

In [93]:
retail

,date,store_nbr,family,sales,tax_amount,total,taxable_category
0,2016-01-01,1,AUTOMOTIVE,0.000,0.00000,0.00000,False
1,2016-01-01,1,BABY CARE,0.000,0.00000,0.00000,True
2,2016-01-01,1,BEAUTY,0.000,0.00000,0.00000,False
3,2016-01-01,1,BEVERAGES,0.000,0.00000,0.00000,False
4,2016-01-01,1,BOOKS,0.000,0.00000,0.00000,False
...,...,...,...,...,...,...,...
1054939,2017-08-15,9,POULTRY,438.133,21.90665,460.03965,False
1054940,2017-08-15,9,PREPARED FOODS,154.553,7.72765,162.28065,False
1054941,2017-08-15,9,PRODUCE,2419.729,120.98645,2540.71545,False
1054942,2017-08-15,9,SCHOOL AND OFFICE SUPPLIES,121.000,6.05000,127.05000,False
1054943,2017-08-15,9,SEAFOOD,16.000,0.80000,16.80000,False

In [94]:
retail['tax_amount'] = (
    retail['sales'] * 0.05 * (retail['family'] != 'BABY CARE')
)

In [95]:
retail

,date,store_nbr,family,sales,tax_amount,total,taxable_category
0,2016-01-01,1,AUTOMOTIVE,0.000,0.00000,0.00000,False
1,2016-01-01,1,BABY CARE,0.000,0.00000,0.00000,True
2,2016-01-01,1,BEAUTY,0.000,0.00000,0.00000,False
3,2016-01-01,1,BEVERAGES,0.000,0.00000,0.00000,False
4,2016-01-01,1,BOOKS,0.000,0.00000,0.00000,False
...,...,...,...,...,...,...,...
1054939,2017-08-15,9,POULTRY,438.133,21.90665,460.03965,False
1054940,2017-08-15,9,PREPARED FOODS,154.553,7.72765,162.28065,False
1054941,2017-08-15,9,PRODUCE,2419.729,120.98645,2540.71545,False
1054942,2017-08-15,9,SCHOOL AND OFFICE SUPPLIES,121.000,6.05000,127.05000,False
1054943,2017-08-15,9,SEAFOOD,16.000,0.80000,16.80000,False

In [96]:
oil['benchmark'] = 90

In [97]:
oil

     price_date  oil_price  benchmark
0    2013-01-01        NaN         90
1    2013-01-02      93.14         90
2    2013-01-03      92.97         90
3    2013-01-04      93.12         90
4    2013-01-07      93.20         90
...         ...        ...        ...
1214 2017-08-28      46.40         90
1215 2017-08-29      46.46         90
1216 2017-08-30      45.96         90
1217 2017-08-31      47.26         90
1218 2017-08-31      47.26         90

[1219 rows x 3 columns]

In [98]:
oil['benchmark_ratio'] = (
    ((oil.loc[:,'oil_price'] / oil.loc[:,'benchmark']) * 100)
    .round(2)
)

In [99]:
oil

     price_date  oil_price  benchmark  benchmark_ratio
0    2013-01-01        NaN         90              NaN
1    2013-01-02      93.14         90           103.49
2    2013-01-03      92.97         90           103.30
3    2013-01-04      93.12         90           103.47
4    2013-01-07      93.20         90           103.56
...         ...        ...        ...              ...
1214 2017-08-28      46.40         90            51.56
1215 2017-08-29      46.46         90            51.62
1216 2017-08-30      45.96         90            51.07
1217 2017-08-31      47.26         90            52.51
1218 2017-08-31      47.26         90            52.51

[1219 rows x 4 columns]

In [100]:
oil['buy'] = np.where(oil['oil_price'] > 100, 'Too High','Buy')

In [101]:
oil

     price_date  oil_price  benchmark  benchmark_ratio  buy
0    2013-01-01        NaN         90              NaN  Buy
1    2013-01-02      93.14         90           103.49  Buy
2    2013-01-03      92.97         90           103.30  Buy
3    2013-01-04      93.12         90           103.47  Buy
4    2013-01-07      93.20         90           103.56  Buy
...         ...        ...        ...              ...  ...
1214 2017-08-28      46.40         90            51.56  Buy
1215 2017-08-29      46.46         90            51.62  Buy
1216 2017-08-30      45.96         90            51.07  Buy
1217 2017-08-31      47.26         90            52.51  Buy
1218 2017-08-31      47.26         90            52.51  Buy

[1219 rows x 5 columns]

In [102]:
conditions = [
    (oil['oil_price'] > 100),
    (oil['oil_price'] <= 100) & (oil['oil_price'] > 50),
    (oil['oil_price'] <= 50)
]

choices = ['Dont buy','Buy','Strong Buy']

oil['buy'] = np.select(conditions,choices,default="Missing")

In [103]:
oil['buy'].value_counts()

Buy           512
Strong Buy    482
Dont buy      182
Missing        43
Name: buy, dtype: int64

In [104]:
retail

,date,store_nbr,family,sales,tax_amount,total,taxable_category
0,2016-01-01,1,AUTOMOTIVE,0.000,0.00000,0.00000,False
1,2016-01-01,1,BABY CARE,0.000,0.00000,0.00000,True
2,2016-01-01,1,BEAUTY,0.000,0.00000,0.00000,False
3,2016-01-01,1,BEVERAGES,0.000,0.00000,0.00000,False
4,2016-01-01,1,BOOKS,0.000,0.00000,0.00000,False
...,...,...,...,...,...,...,...
1054939,2017-08-15,9,POULTRY,438.133,21.90665,460.03965,False
1054940,2017-08-15,9,PREPARED FOODS,154.553,7.72765,162.28065,False
1054941,2017-08-15,9,PRODUCE,2419.729,120.98645,2540.71545,False
1054942,2017-08-15,9,SCHOOL AND OFFICE SUPPLIES,121.000,6.05000,127.05000,False
1054943,2017-08-15,9,SEAFOOD,16.000,0.80000,16.80000,False

In [105]:
retail['family'].value_counts()

AUTOMOTIVE                    31968
HOME APPLIANCES               31968
SCHOOL AND OFFICE SUPPLIES    31968
PRODUCE                       31968
PREPARED FOODS                31968
POULTRY                       31968
PLAYERS AND ELECTRONICS       31968
PET SUPPLIES                  31968
PERSONAL CARE                 31968
MEATS                         31968
MAGAZINES                     31968
LIQUOR,WINE,BEER              31968
LINGERIE                      31968
LAWN AND GARDEN               31968
LADIESWEAR                    31968
HOME CARE                     31968
HOME AND KITCHEN II           31968
BABY CARE                     31968
HOME AND KITCHEN I            31968
HARDWARE                      31968
GROCERY II                    31968
GROCERY I                     31968
FROZEN FOODS                  31968
EGGS                          31968
DELI                          31968
DAIRY                         31968
CLEANING                      31968
CELEBRATION                   31968
BREAD/BAKERY                  31968
BOOKS                         31968
BEVERAGES                     31968
BEAUTY                        31968
SEAFOOD                       31968
Name: family, dtype: int64

In [106]:
product_category_dict = {
    'PRODUCE': 'Grocery',
    'POULTRY': 'Grocery',
    'EGGS': 'Grocery',
    'GROCERY I ': 'Grocery',
    'GROCERY II': 'Grocery',
}

In [107]:
retail.loc[:,'family'].map(product_category_dict)

0              NaN
1              NaN
2              NaN
3              NaN
4              NaN
            ...
1054939    Grocery
1054940        NaN
1054941    Grocery
1054942        NaN
1054943        NaN
Name: family, Length: 1054944, dtype: object

In [108]:
sample_retail

              DATE  STORE NUMBER     FAMILY     SALES
74292   2016-02-11            43       DELI   212.000
13506   2016-01-08            38       DELI   131.545
882588  2017-05-11            23  BEVERAGES  1194.000
445008  2016-09-06            45  BEVERAGES  8339.000
495966  2016-10-05            25       DELI     0.000

In [109]:
sample_retail.assign(tax_amount=sample_retail['SALES'] * 0.05)

              DATE  STORE NUMBER     FAMILY     SALES  tax_amount
74292   2016-02-11            43       DELI   212.000    10.60000
13506   2016-01-08            38       DELI   131.545     6.57725
882588  2017-05-11            23  BEVERAGES  1194.000    59.70000
445008  2016-09-06            45  BEVERAGES  8339.000   416.95000
495966  2016-10-05            25       DELI     0.000     0.00000

In [110]:
sample_retail

              DATE  STORE NUMBER     FAMILY     SALES
74292   2016-02-11            43       DELI   212.000
13506   2016-01-08            38       DELI   131.545
882588  2017-05-11            23  BEVERAGES  1194.000
445008  2016-09-06            45  BEVERAGES  8339.000
495966  2016-10-05            25       DELI     0.000

In [117]:
sample_retail.assign(
    tax_amount=sample_retail['SALES'] * 0.05,
    family_abbrev = sample_retail['FAMILY'].str[:3],
    tax_amount_2 = lambda x: x['tax_amount'] * 100
).query('tax_amount > 100')

,DATE,STORE NUMBER,FAMILY,SALES,tax_amount,family_abbrev,tax_amount_2
445008,2016-09-06,45,BEVERAGES,8339.0,416.95,BEV,41695.0

In [125]:
sample_retail.columns = [col.lower() for col in sample_retail.columns]

In [126]:
sample_retail.astype({'family': 'category'})

              date  store number     family     sales
74292   2016-02-11            43       DELI   212.000
13506   2016-01-08            38       DELI   131.545
882588  2017-05-11            23  BEVERAGES  1194.000
445008  2016-09-06            45  BEVERAGES  8339.000
495966  2016-10-05            25       DELI     0.000

In [127]:
sample_retail.dtypes

date             object
store number      int64
family           object
sales           float64
dtype: object

In [129]:
retail = pd.read_csv(path_retail)

In [132]:
retail.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1054944 entries, 0 to 1054943
Data columns (total 6 columns):
 #   Column       Non-Null Count    Dtype
---  ------       --------------    -----
 0   id           1054944 non-null  int64
 1   date         1054944 non-null  object
 2   store_nbr    1054944 non-null  int64
 3   family       1054944 non-null  object
 4   sales        1054944 non-null  float64
 5   onpromotion  1054944 non-null  int64
dtypes: float64(1), int64(3), object(2)
memory usage: 167.8 MB

In [134]:
retail.loc[:,'family'].value_counts()

AUTOMOTIVE                    31968
HOME APPLIANCES               31968
SCHOOL AND OFFICE SUPPLIES    31968
PRODUCE                       31968
PREPARED FOODS                31968
POULTRY                       31968
PLAYERS AND ELECTRONICS       31968
PET SUPPLIES                  31968
PERSONAL CARE                 31968
MEATS                         31968
MAGAZINES                     31968
LIQUOR,WINE,BEER              31968
LINGERIE                      31968
LAWN AND GARDEN               31968
LADIESWEAR                    31968
HOME CARE                     31968
HOME AND KITCHEN II           31968
BABY CARE                     31968
HOME AND KITCHEN I            31968
HARDWARE                      31968
GROCERY II                    31968
GROCERY I                     31968
FROZEN FOODS                  31968
EGGS                          31968
DELI                          31968
DAIRY                         31968
CLEANING                      31968
CELEBRATION                   31968
BREAD/BAKERY                  31968
BOOKS                         31968
BEVERAGES                     31968
BEAUTY                        31968
SEAFOOD                       31968
Name: family, dtype: int64

In [136]:
retail = retail.astype({'family': 'category'})

In [138]:
retail.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1054944 entries, 0 to 1054943
Data columns (total 6 columns):
 #   Column       Non-Null Count    Dtype
---  ------       --------------    -----
 0   id           1054944 non-null  int64
 1   date         1054944 non-null  object
 2   store_nbr    1054944 non-null  int64
 3   family       1054944 non-null  category
 4   sales        1054944 non-null  float64
 5   onpromotion  1054944 non-null  int64
dtypes: category(1), float64(1), int64(3), object(1)
memory usage: 100.6 MB

In [141]:
sample_retail['sales_int'] = sample_retail['sales'].astype('int')

In [142]:
sample_retail.dtypes

date             object
store number      int64
family           object
sales           float64
sales_int         int32
dtype: object

In [145]:
sample_retail = sample_retail.astype({'date': 'datetime64[ns]','sales_int': 'float'})

In [144]:
sample_retail

              date  store number     family     sales  sales_int
74292   2016-02-11            43       DELI   212.000        212
13506   2016-01-08            38       DELI   131.545        131
882588  2017-05-11            23  BEVERAGES  1194.000       1194
445008  2016-09-06            45  BEVERAGES  8339.000       8339
495966  2016-10-05            25       DELI     0.000          0

In [149]:
sample_retail['sales_int'] = sample_retail['sales'].astype('int16')

In [147]:
sample_retail.dtypes

date            datetime64[ns]
store number             int64
family                  object
sales                  float64
sales_int                int16
dtype: object